loadtest/create-urls.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      name: "Ramp up"
    - duration: 30
      arrivalRate: 100
      name: "Peak load"

scenarios:
  - name: "Create short URL"
    flow:
      - post:
          url: "/api/shorten"
          json:
            url: "https://www.example.com/test/{{ $randomNumber() }}"
          capture:
            - json: "$.shortCode"
              as: "shortCode"